Revit 2024 API
FabricSheetType.SetMinorLayoutAsActualSpacing Method
 Sets the minor layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetMinorLayoutAsActualSpacing(
	double overallLength,
	double majorStartOverhang,
	double spacing
)
Visual Basic
Public Sub SetMinorLayoutAsActualSpacing ( _
	overallLength As Double, _
	majorStartOverhang As Double, _
	spacing As Double _
)
Visual C++
public:
void SetMinorLayoutAsActualSpacing(
	double overallLength,
	double majorStartOverhang,
	double spacing
)
Parameters
overallLength
Type: System.Double
 The entire length of the wire sheet in the major direction.
majorStartOverhang
Type: System.Double
 The distance from the edge of the sheet to the first wire in the major direction.
spacing
Type: System.Double
 The distance between the wires in the minor direction.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for overallLength is not a number -or- The given value for majorStartOverhang is not a number -or- The given value for spacing is not a number -or- The arguments are not consistent, please specify proper input values.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for overallLength must be greater than 0 and no more than 30000 feet. -or- The given value for majorStartOverhang must be between 0 and 30000 feet. -or- The given value for spacing must be greater than 0 and no more than 30000 feet.
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace